# Напишіть програму, яка дає змогу користувачеві заповнити список із клавіатури числами. 
# Після отримання даних відобразіть на екран меню, яке дозволяє виконати такі операції:

# Відображення списку;
# Отримання максимального значення у списку;
# Отримання мінімального значення у списку;
# Відображення значення елемента за індексом, введеним користувачем;
# Видалення елемента за індексом, введеним користувачем.

# Обробіть виняток, що виникає під час виходу за межі списку 
# (користувач ввів неправильне значення для індексу елемента в списку), і виведіть повідомлення про помилку.

from actions import actions

user_arr = []

def create_list(arr):
    
    while True:
        number = input("Enter number or 'exit': ")
        
        if number.lower() == "exit":
            print(actions(arr))
            break
        
        try:
            number = int(number)
            arr.append(number)
        except:
            print("The value is incorrect")
    
    
create_list(user_arr)
